import java.util.ArrayList;
import java.util.List;

/**
 * 2. Дано перелік рядків (можна взяти вірш, як варіант). Знайти кількість унікальних рядків завдовжки більше 8 символів
 * (можна варіювати в залежності від Вашого вхідного тексту).
 */

public class Task2 {
    public static void main(String[] args) {
        String str = """
                Ой у лузі червона калина похилилася
                Чогось наша славна Україна зажурилася
                А ми тую червону калину підіймемо
                А ми нашу славну Україну
                Гей, гей, розвеселимо!
                А ми тую червону калину підіймемо
                А ми нашу славну Україну
                Гей, гей, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!
                Марширують наші добровольці
                У кривавий тан
                Визволяти братів-українців
                З московських кайдан
                А ми тую червону калину підіймемо
                А ми нашу славну Україну
                Гей, гей, розвеселимо!
                А ми тую червону калину підіймемо
                А ми нашу славну Україну
                Гей, гей, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!
                Не хилися, червона калино
                Маєш білий цвіт
                Не журися, славна Україно
                Маєш вільний рід
                А ми тую червону калину підіймемо
                А ми нашу славну Україну
                Гей, гей, розвеселимо!
                А ми тую червону калину підіймемо
                А ми нашу славну Україну
                Гей, гей, розвеселимо!
                Україну
                Гей, розвеселимо, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!
                Гей, розвеселимо
                Україну
                Гей, розвеселимо, розвеселимо!""";
        System.out.println(countUnique(str));
    }

    public static Integer countUnique(String text) {
        List<String> uniqueLine = new ArrayList<>();
        for (String line : text.split("\\n")) {
            if(!uniqueLine.contains(line)){
                uniqueLine.add(line);
            }
        }
        System.out.println(uniqueLine);

        return  uniqueLine.size();
    }
}
